# Data Loading, Storage, and File Formats

### 6.1 Reading and Writing Data in Text Format
* Parsing Functions in Pandas

![Parsing functions in pandas](./snaps/6.1.1.PNG)
![Parsing functions in pandas](./snaps/6.1.2.PNG)

* Indexing
    * Can treat one or more columns as the returned DataFrame, and whether to get column names from the file, the user, or not at all.
* Type inference and data conversion
    * This includes the user-defined value conversions and custom list of missing value markers.
* Datetime parsing
    * Includes combining capability, including combining date and time information spread over multiple columns into a single column in the result.
* Iterating
    * Support for iterating over chunks of very large files.
* Unclean data issues
    * Skipping rows or a footer, comments, or other minor things like numeric data with thousands separated by commas

In [1]:
import pandas as pd

###### Reading a CSV file

In [2]:
df = pd.read_csv('files/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [3]:
df = pd.read_table('files/ex1.csv', sep=',')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

###### If a file dont have a header row

In [4]:
# if it is read as normal it will auto select first row as header
pd.read_csv('files/ex2.csv')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [5]:
# assigning default column names
pd.read_csv('files/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [6]:
# manula header
pd.read_csv('files/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

###### assigning some column as index

In [7]:
names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('files/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

######  hierarchical index

In [8]:
pd.read_csv('files/csv_mindex.csv')

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [9]:
pd.read_csv('files/csv_mindex.csv',index_col=['key1', 'key2'])

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

###### files with whitespace or some other pattern to separate fields

In [10]:
list(open('files/ex3.txt'))

['A B C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb 0.927272 0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382 1.100491']

In [11]:
# use regular expression for sep value
pd.read_table('files/ex3.txt', sep='\s+')

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

###### Skipping Rows

In [12]:
pd.read_csv('files/ex4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
 9                                                 10       11  12       foo

In [13]:
pd.read_csv('files/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

###### Dealing with Missing data

In [14]:
result = pd.read_csv('files/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [15]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [16]:
result = pd.read_csv('files/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [17]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
pd.read_csv('files/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

###### Some Frequenty used options to read  a file

![Some read_csv/read_table function arguments](./snaps/6.1.3.PNG)
![Some read_csv/read_table function arguments](./snaps/6.1.4.PNG)

#### Reading Text Files in Pieces

In [18]:
result = pd.read_csv('files/ex6.csv')
result

             One         Two  Three    Four Key
0       0.013316    0.090909      1   0.008   a
1       0.026631    0.181818      2   0.016   b
2       0.039947    0.272727      3   0.024   f
3       0.053262    0.363636      4   0.032   q
4       0.066578    0.454545      5   0.040   w
...          ...         ...    ...     ...  ..
9994  133.089214  908.636364   9995  79.960   i
9995  133.102530  908.727273   9996  79.968   o
9996  133.115846  908.818182   9997  79.976   p
9997  133.129161  908.909091   9998  79.984   a
9998  133.142477  909.000000   9999  79.992   s

[9999 rows x 5 columns]

###### Read small number of rows

In [19]:
pd.read_csv('files/ex6.csv', nrows=11)

         One       Two  Three   Four Key
0   0.013316  0.090909      1  0.008   a
1   0.026631  0.181818      2  0.016   b
2   0.039947  0.272727      3  0.024   f
3   0.053262  0.363636      4  0.032   q
4   0.066578  0.454545      5  0.040   w
5   0.079893  0.545455      6  0.048   e
6   0.093209  0.636364      7  0.056   r
7   0.106525  0.727273      8  0.064   t
8   0.119840  0.818182      9  0.072   y
9   0.133156  0.909091     10  0.080   u
10  0.146471  1.000000     11  0.088   i

###### read a file in pieces

In [20]:
chunker = pd.read_csv('files/ex6.csv', chunksize=1000)
chunker

In [21]:
chunker = pd.read_csv('files/ex6.csv', chunksize=1000)
tot = pd.Series([],dtype="float64")
for piece in chunker:
    tot = tot.add(piece['Key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)
tot[:10]

b    769.0
f    769.0
a    514.0
j    512.0
v    512.0
m    512.0
l    512.0
k    512.0
n    512.0
z    512.0
dtype: float64

#### Writing Data to Text Format

In [22]:
data = pd.read_csv('files/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [23]:
data.to_csv('files/out.csv')

In [24]:
pd.read_csv('files/out.csv')

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

###### or

In [25]:
import sys
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [26]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [27]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [28]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

###### or

In [29]:
dates = pd.date_range('1/1/2000', periods=7)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [30]:
import numpy as np
ts = pd.Series(np.arange(7), index=dates)
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [31]:
ts.to_csv('files/tseries.csv')

In [32]:
pd.read_csv('files/tseries.csv')

   Unnamed: 0  0
0  2000-01-01  0
1  2000-01-02  1
2  2000-01-03  2
3  2000-01-04  3
4  2000-01-05  4
5  2000-01-06  5
6  2000-01-07  6

#### Working with Delimited Formats

In [33]:
pd.read_csv('files/ex7.csv')

   "a"  "b"  "c"
0  "1"  "2"  "3"
1  "1"  "2"  "3"

In [34]:
import csv
f = open('files/ex7.csv')
reader = csv.reader(f)
reader

In [35]:
for line in reader:
    print(line)

['"a"', '"b"', '"c"']
['"1"', '"2"', '"3"']
['"1"', '"2"', '"3"']

In [36]:
with open('files/ex7.csv') as f:
    lines = list(csv.reader(f))

In [37]:
header, values = lines[0], lines[1:]

In [38]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [39]:
data_dict

{'"a"': ('"1"', '"1"'), '"b"': ('"2"', '"2"'), '"c"': ('"3"', '"3"')}

In [40]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
f = open('files/ex7.csv')
reader = csv.reader(f, dialect=my_dialect)
reader

In [41]:
# Dialectic options
reader = csv.reader(f, delimiter='|')

![CSV dialect options](./snaps/6.1.5.Png)
![CSV dialect options](./snaps/6.1.6.Png)

In [42]:
with open('files/mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))#
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

#### JSON Data

In [43]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
 {"name": "Katie", "age": 38,
 "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""
obj

'\n{"name": "Wes",\n "places_lived": ["United States", "Spain", "Germany"],\n "pet": null,\n "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},\n {"name": "Katie", "age": 38,\n "pets": ["Sixes", "Stache", "Cisco"]}]\n}\n'

In [44]:
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [45]:
asjson = json.dumps(result)

In [46]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [47]:
siblings

    name  age
0  Scott   30
1  Katie   38

###### example

In [48]:
pd.read_json('files/example.json')

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [49]:
print(data.to_json())

{"something":{"0":"one","1":"two","2":"three"},"a":{"0":1,"1":5,"2":9},"b":{"0":2,"1":6,"2":10},"c":{"0":3.0,"1":null,"2":11.0},"d":{"0":4,"1":8,"2":12},"message":{"0":null,"1":"world","2":"foo"}}

In [50]:
print(data.to_json(orient='records'))

[{"something":"one","a":1,"b":2,"c":3.0,"d":4,"message":null},{"something":"two","a":5,"b":6,"c":null,"d":8,"message":"world"},{"something":"three","a":9,"b":10,"c":11.0,"d":12,"message":"foo"}]

#### XML and HTML: Web Scraping

In [51]:
tables = pd.read_html('files/fdic_failed_bank_list.html')

In [52]:
len(tables)

1

In [53]:
failures = tables[0]

In [54]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [55]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [56]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

###### Example

In [59]:
from lxml import objectify
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()
root

In [60]:
root.get('href')

'http://www.google.com'

In [61]:
root.text

'Google'